<?xml version="1.0" ?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,128,128,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="new_shape__87" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="new_shape__87"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="new_shape__87">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model_1/conv2d_1/BiasAdd__9" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_1/BiasAdd__9"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_1/BiasAdd__9:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model_1/conv2d_1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 3, 3" offset="32" size="576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_1/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_1/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model_1/conv2d_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_1/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_58" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="608" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_1/conv2d_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_57, Reshape_58, model_1/conv2d_1/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_1/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model_1/conv2d_1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/conv2d_1/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_1/max_pooling2d_1/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/max_pooling2d_1/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/max_pooling2d_1/MaxPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model_1/conv2d_2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="672" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_2/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_2/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model_1/conv2d_2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_2/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_108" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="9888" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model_1/conv2d_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_107, Reshape_108, model_1/conv2d_2/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_2/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model_1/conv2d_2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/conv2d_2/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model_1/max_pooling2d_2/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/max_pooling2d_2/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/max_pooling2d_2/MaxPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model_1/conv2d_3/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="9952" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_3/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_3/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model_1/conv2d_3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_3/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_158" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="19168" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model_1/conv2d_3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_157, Reshape_158, model_1/conv2d_3/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_3/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model_1/conv2d_3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/conv2d_3/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model_1/max_pooling2d_3/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/max_pooling2d_3/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/max_pooling2d_3/MaxPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model_1/conv2d_4/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="19232" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_4/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_4/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_1/conv2d_4/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_4/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_208" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="28448" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model_1/conv2d_4/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_207, Reshape_208, model_1/conv2d_4/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_4/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model_1/conv2d_4/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_4/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/conv2d_4/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model_1/max_pooling2d_4/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/max_pooling2d_4/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/max_pooling2d_4/MaxPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model_1/conv2d_5/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="28512" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_5/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_5/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_1/conv2d_5/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_5/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_258" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="37728" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model_1/conv2d_5/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_257, Reshape_258, model_1/conv2d_5/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_5/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model_1/conv2d_5/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_5/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/conv2d_5/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Range_294" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="37792" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model_1/global_average_pooling2d_1/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Range_294, model_1/global_average_pooling2d_1/Mean"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/global_average_pooling2d_1/Mean:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="const_axes__92" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="37792" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_axes__92"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_axes__92">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model_1/global_average_pooling2d_1/Mean_Squeeze__93" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/global_average_pooling2d_1/Mean_Squeeze__93"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/global_average_pooling2d_1/Mean_Squeeze__93:0">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_2534" type="Const" version="opset1">
			<data element_type="f32" shape="2, 16" offset="37808" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_323, model_1/out_tags/MatMul/ReadVariableOp:0, model_1/out_tags/MatMul_Gemm__8/WithoutBiases"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_1/out_tags/MatMul_Gemm__8/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_323, model_1/out_tags/MatMul/ReadVariableOp:0, model_1/out_tags/MatMul_Gemm__8/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_2593" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2" offset="37936" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model_1/out_tags/MatMul_Gemm__8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_324, model_1/out_tags/MatMul_Gemm__8"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/out_tags/MatMul_Gemm__8:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="out_tags" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="out_tags"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="out_tags">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Shape__32" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_349, Shape__32"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__32:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="const_zero__64" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="37944" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_654, Slice__69, const_two__53, const_zero__64"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_zero__64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="const_two__53" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="37952" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_654, Slice__69, const_two__53, const_zero__64"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_two__53">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Broadcast_330" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="37960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_330, Slice__33, const_two__53, const_zero__64"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Slice__33" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_330, Broadcast_654, Slice__33, Slice__69, const_two__53, const_zero__64"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__33:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="const_fold_opt__90" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="37968" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__90"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__90">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Concat__35" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat__35, const_fold_opt__90"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Concat__35:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convert_351" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_351"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Convert_350" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_350"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Divide_352" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Divide_352"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_2594" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="37984" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Add_354" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_354"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Resize__36" type="Interpolate" version="opset4">
			<data mode="nearest" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="round_prefer_ceil" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Resize__36"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="Resize__36:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model_1/concatenate_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/concatenate_1/concat"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/concatenate_1/concat:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model_1/conv2d_6/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 3, 3" offset="37988" size="18432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_6/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_6/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model_1/conv2d_6/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_6/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_406" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="56420" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model_1/conv2d_6/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_405, Reshape_406, model_1/conv2d_6/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_6/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model_1/activation_1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/activation_1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/activation_1/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Shape__44" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_457, Shape__44"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__44:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Broadcast_438" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="37960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_438, Slice__45, const_two__53, const_zero__64"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Slice__45" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_438, Broadcast_654, Slice__45, Slice__69, const_two__53, const_zero__64"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__45:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="const_fold_opt__89" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="56484" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__89"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__89">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Concat__47" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat__47, const_fold_opt__89"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Concat__47:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Convert_459" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_459"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Convert_458" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_458"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Divide_460" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Divide_460"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_2595" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="37984" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Add_462" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_462"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Resize__48" type="Interpolate" version="opset4">
			<data mode="nearest" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="round_prefer_ceil" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Resize__48"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="Resize__48:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model_1/concatenate_2/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/concatenate_2/concat"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/concatenate_2/concat:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model_1/conv2d_7/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 3, 3" offset="56500" size="18432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_7/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_7/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model_1/conv2d_7/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_7/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_514" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="74932" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model_1/conv2d_7/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_513, Reshape_514, model_1/conv2d_7/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_7/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model_1/activation_1/Relu_1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/activation_1/Relu_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/activation_1/Relu_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Shape__56" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_565, Shape__56"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__56:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Broadcast_546" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="37960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_546, Slice__57, const_two__53, const_zero__64"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Slice__57" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_546, Broadcast_654, Slice__57, Slice__69, const_two__53, const_zero__64"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__57:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="const_fold_opt__88" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="74996" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__88"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__88">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Concat__59" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat__59, const_fold_opt__88"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Concat__59:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Convert_567" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_567"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Convert_566" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_566"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Divide_568" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Divide_568"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_2596" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="37984" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Add_570" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_570"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Resize__60" type="Interpolate" version="opset4">
			<data mode="nearest" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="round_prefer_ceil" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Resize__60"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="Resize__60:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model_1/concatenate_3/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/concatenate_3/concat"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/concatenate_3/concat:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model_1/conv2d_8/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 3, 3" offset="75012" size="18432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_8/Conv2D/ReadVariableOp:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model_1/conv2d_8/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model_1/conv2d_8/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/conv2d_8/BiasAdd/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_622" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="93444" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="model_1/conv2d_8/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_621, Reshape_622, model_1/conv2d_8/BiasAdd"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/conv2d_8/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model_1/activation_1/Relu_2" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/activation_1/Relu_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/activation_1/Relu_2:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Shape__68" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_673, Shape__68"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__68:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Broadcast_654" type="Const" version="opset1">
